farmaGestion/app/controllers/inventory_templates_controller.rb

  def add_element
     @inventory_template = InventoryTemplate.find(params[:id])
     @inventory_template.elements << Element.find(params[:element_id])
---
SELECT * FROM `inventory_templates` WHERE (`inventory_templates`.`id` = 3)
INSERT INTO `elements_inventory_templates` (`inventory_template_id`, `element_id`) VALUES (3, 5)
SELECT * FROM `elements` WHERE (`elements`.`id` = 5)

  def remove_element

     @inventory_template = InventoryTemplate.find(params[:id])
     @inventory_template.elements.delete(Element.find(params[:element_id]))
---
SELECT * FROM `inventory_templates` WHERE (`inventory_templates`.`id` = 3)
DELETE FROM `elements_inventory_templates` WHERE inventory_template_id = 3 AND element_id IN (4)
SELECT * FROM `elements` WHERE (`elements`.`id` = 4)

  def index
    @inventory_templates = InventoryTemplate.all
---
SELECT * FROM `inventory_templates` ORDER BY inventory_templates.id DESC LIMIT 1

  def show
     @inventory_template = InventoryTemplate.find(params[:id])
---
SELECT * FROM `inventory_templates` WHERE (`inventory_templates`.`id` = 3)

  def edit
     @inventory_template = InventoryTemplate.find(params[:id])
---
SELECT * FROM `inventory_templates` WHERE (`inventory_templates`.`id` = 7)

  def create
     @inventory_template = InventoryTemplate.new(params[:inventory_template])

    respond_to do |format|
      if  @inventory_template.save
---
INSERT INTO `inventory_templates` (`name`, `periodicity_id`, `created_at`, `updated_at`) VALUES(NULL, NULL, '2011-04-09 14:18:33', '2011-04-09 14:18:33')

  def update
     @inventory_template = InventoryTemplate.find(params[:id])
---
SELECT * FROM `inventory_templates` WHERE (`inventory_templates`.`id` = 3)