farmaGestion/app/controllers/periodicities_controller.rb

  def index
    @periodicities = Periodicity.all
---
SELECT * FROM `periodicities`

  def edit
    @periodicity = Periodicity.find(params[:id])
---
SELECT * FROM `periodicities` WHERE (`periodicities`.`id` = 6)