farmaGestion/app/controllers/units_controller.rb

  def index
    @units = Unit.all
---
SELECT * FROM `units`

  def show
    @unit = Unit.find(params[:id])
---
SELECT * FROM `units` WHERE (`units`.`id` = 1)

  def edit
    @unit = Unit.find(params[:id])
---
SELECT * FROM `units` WHERE (`units`.`id` = 1)

  def create
    @unit = Unit.new(params[:unit])

    respond_to do |format|
      if @unit.save
---
INSERT INTO `units` (`name`, `created_at`, `updated_at`) VALUES(0, '2011-04-02 13:58:42', '2011-04-02 13:58:42')

  def destroy
    @unit = Unit.find(params[:id])
    @unit.destroy
---
SELECT * FROM `units` WHERE (`units`.`id` = 6)
DELETE FROM `units` WHERE `id` = 6